      *>----------------------------------------------------*
      *> Definition de l'enregistrement CLIENT              *
      *>----------------------------------------------------*
       01  CLIENT-REC.
           05 NUM-CLIENT        PIC X(6).
           05 NOM-CLIENT        PIC X(20).
           05 PRENOM-CLIENT     PIC X(20).
           05 ADRESSE-CLIENT    PIC X(50).
           05 CP-CLIENT         PIC X(5).
           05 VILLE-CLIENT      PIC X(25).
