      *>----------------------------------------------------*
      *> Definition de l'enregistrement COMPTE              *
      *>----------------------------------------------------*
           05 CPT-NUM-COMPTE        PIC X(10).
           05 CPT-NUM-CLIENT        PIC X(6).
           05 CPT-TYPE-COMPTE       PIC X(2).
           05 CPT-DATE-OUVERTURE    PIC 9(8).
           05 CPT-SOLDE             PIC S9(9)V99.
           05 CPT-STATUT            PIC X(1).
           05 CPT-PLAFOND-DECOUVERT PIC S9(7)V99.
