       *>----------------------------------------------------*
       *> Enregistrement des parametres / compteurs          *
       *>----------------------------------------------------*
           05 PRM-DERNIER-ID-CLIENT PIC 9(5).
           05 PRM-DERNIER-ID-COMPTE PIC 9(9).
           05 PRM-DERNIER-ID-OPR    PIC 9(8).
